# Вход
# От конзолата се четат 4 реда:
# 1.	Дължина в см – цяло число в интервала [10 … 500]
# 2.	Широчина в см – цяло число в интервала [10 … 300]
# 3.	Височина в см – цяло число в интервала [10… 200]
# 4.	Процент  – реално число в интервала [0.000 … 100.000]
# Изход
# Да се отпечата на конзолата едно число:
# •	литрите вода, които ще  събира аквариума.

lenght = int(input())
widht = int(input())
height = int(input())
percent_sand = float(input())
tank_volume = (lenght * widht * height) / 1000
liters_water = tank_volume * (1 - percent_sand / 100)
print(liters_water)